app/Controllers/HomeController.php

    public function topup(int $gameId)
    {
        $gameModel = new GameModel();
        $itemModel = new ItemModel();

        $game = $gameModel->find($gameId);
---
SELECT *
FROM `games`
WHERE `games`.`id` = 1