app/Models/GameModel.php

    public function getActive()
    {
        return $this->where('status', 'aktif')->orderBy('nama_game', 'ASC')->findAll();
---
SELECT *
FROM `games`
WHERE `status` = 'aktif'
ORDER BY `nama_game` ASC