app/Models/ItemModel.php

    public function getWithGame(int $id)
    {
        return $this->select('top_up_items.*, games.nama_game, games.id AS game_id_ref')
                    ->join('games', 'games.id = top_up_items.game_id')
                    ->find($id);
---
SELECT `top_up_items`.*, `games`.`nama_game`, `games`.`id` AS `game_id_ref`
FROM `top_up_items`
JOIN `games` ON `games`.`id` = `top_up_items`.`game_id`
WHERE `top_up_items`.`id` = 6